driver-tests/bpelse/WaitingRequestLifeSpan/WaitingRequestLifeSpanApp/test/OnEventTimeOut/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://j2ee.netbeans.org/wsdl/requestlifespan/onevent/wsdl">
  <soapenv:Body>
    <wsdl:mainOperation>
      <input>test1</input>
    </wsdl:mainOperation>
  </soapenv:Body>
</soapenv:Envelope>